import Image from 'next/image'
import { Container } from '../components/Container'
import { Nav } from '../components/Nav'
import { Footer } from '../components/Footer'

export default function About() {
  return (
    <>
      <Container>
        <Nav />
        <div className="flex w-11/12 fixed top-1/4">
          <div className="w-full">
            <Image src="/images/avatar.png" width={300} height={300} alt="My avatar" />
          </div>
          <div className="w-full">
            <h2 className="text-5xl">うちむら ゆう</h2>
            <div className="mt-5 h-96 overflow-y-scroll">
              <p className="my-3">平成８年９月１２日生まれ（２５歳）</p>
              <p className="my-1">茨城県 👉 東京 👉 神奈川県横浜市在住</p>
              <p className="my-1">趣味: 映画鑑賞・アニメ鑑賞・筋トレ・旅行</p>
              <p className="my-1">左右の名：●●</p>
              <p className="my-1">
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。 こんにちは。
                こんにちは。 こんにちは。 こんにちは。 こんにちは。
              </p>
            </div>
            <div>
              <h1>SKILL</h1>
              <img src="#" alt="" />
              <img src="#" alt="" />
              <img src="#" alt="" />
            </div>
          </div>
        </div>
        <Footer />
      </Container>
    </>
  )
}
